Revit 2027 API
ParameterTypeId.StructuralAttachmentStartValueRatio Property
 "Start Attachment Ratio"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentStartValueRatio { get; }
Public Shared ReadOnly Property StructuralAttachmentStartValueRatio As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentStartValueRatio {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentStartValueRatio : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace